let header_mv = new Vue({
    el: "header",
    data: {},
    methods: {}
})
let main_mv = new Vue({
    el: "main",
    data: {
        counter: 0,
        allSpecs: {
            'Acura': {
                "Все модели": [],
                "CL": {
                    "CL 1997-2003": {
                        main: [
                            {key: "Начало производства", value: "январь 1999"},
                            {key: "Окончание производства", value: "январь 2003"},
                            {key: "Кузов", value: "2 дв. купе"}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: "V6"},
                            {key: "Марка топлива:", value: "АИ-95"},
                            {key: "Объем двигателя, куб. см.:", value: "3210"},
                            {key: "Клапанов на цилиндр:", value: "4"},
                            {key: "Мощность, л.с.:", value: "263"},
                            {key: "Достигается при об. в мин.:", value: "6100"},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: "314/3500"},
                            {key: "Максимальная скорость, км/ч:", value: "235"},
                            {key: "Время разгона до 100 км/ч, сек.:", value: "6.8"},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: "12.4"},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: "8.1"},
                            {key: "Компоновка двигателя:", value: "Спереди, поперечно"},
                            {key: "Система питания:", value: "Распределенный впрыск"},
                            {key: "Коэффициент сжатия:", value: "10.3"}
                        ],
                        gear: [
                            {key: "Тип привода:", value: "Передний"}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: "АКПП"},
                            {key: "Количество ступеней:", value: "5"}
                        ],
                        suspension: [
                            {key: "Передняя:", value: "Винтовая пружина"},
                            {key: "Задняя:", value: "Винтовая пружина"}
                        ],
                        brakes: [
                            {key: "Передние:", value: "Дисковые вентилируемые"},
                            {key: "Задние:", value: "Дисковые"}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: "4877"},
                            {key: "Ширина, мм:", value: "1793"},
                            {key: "Высота, мм:", value: "1410"},
                            {key: "Колесная база, мм:", value: "2715"},
                            {key: "Колея колес спереди, мм:", value: "1552"},
                            {key: "Колея колес сзади, мм:", value: "1547"},
                        ],
                        other: [
                            {key: "Количество мест:", value: "4"},
                            {key: "Размер шин:", value: "215/50 R17"},
                            {key: "Снаряженная масса, кг:", value: "1615"},
                            {key: "Объем багажника, л:", value: "396"},
                            {key: "Объем топливного бака, л:", value: "65"}
                        ]

                    }
                },
                "EL": {
                    "EL 2003-2007": {
                        main: [
                            {key: "Начало производства", value: "январь 2003"},
                            {key: "Окончание производства", value: "январь 2007"},
                            {key: "Кузов", value: "4 дв. седан"}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: "4"},
                            {key: "Марка топлива:", value: "АИ-95"},
                            {key: "Объем двигателя, куб. см.:", value: "1700"},
                            {key: "Клапанов на цилиндр:", value: "4"},
                            {key: "Мощность, л.с.:", value: "127"},
                            {key: "Достигается при об. в мин.:", value: "6700"},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: "114 / 4800"},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: "7.2"},
                            {key: "Компоновка двигателя:", value: "Спереди, поперечно"},
                            {key: "Система питания:", value: "Распределённый впрыск"}
                        ],
                        gear: [
                            {key: "Тип привода:", value: "Передний"}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: "МКПП"},
                            {key: "Количество ступеней:", value: "5"}
                        ],
                        suspension: [
                            {key: "Передняя:", value: "Независимая, сдвоенный треугольный поперечный рычаг, винтовая пружина"},
                            {key: "Задняя:", value: "Независимая продольный рычаг, нижний поперечный рычаг, верхний поперечный рычаг, коаксиальный аморт"}
                        ],
                        brakes: [
                            {key: "Передние:", value: "Дисковые вентилируемые"},
                            {key: "Задние:", value: "Дисковые"}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: "4505"},
                            {key: "Ширина, мм:", value: "1715"},
                            {key: "Высота, мм:", value: "1440"},
                            {key: "Колесная база, мм:", value: "2620"},
                            {key: "Колея колес спереди, мм:", value: "1469"},
                            {key: "Колея колес сзади, мм:", value: "1469"}
                        ],
                        other: [
                            {key: "Количество мест:", value: "5"},
                            {key: "Размер шин:", value: "195/60 R15"},
                            {key: "Снаряженная масса, кг:", value: "1182"},
                            {key: "Объем багажника, л:", value: "50"},
                            {key: "Объем топливного бака, л:", value: "225"}
                        ]
                    },
                    "EL 2001-2003": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                    "EL 1995-1999": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    }
                },
                "ILX": {
                    "ILX 2012-2015": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                },
                "Integra": {
                    "Integra 1997-2001": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                    "Integra 1995-2001": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                    "Integra 1991-2001": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    }
                },
                "Legend": {
                    "Legend IV 2006-...": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                    "Legend III 1996-2006": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                    "Legend II 1991-1996": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                    "Legend II 1991-1996": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    }
                },
                "MDX": {
                    "MDX 2016-...": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                    "MDX 2013-2016": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                    "MDX 2007-2013": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                    "MDX 2001-2007": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                },
                "NSX": {
                    "NSX 2017-...": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                    "NSX 2002-2005": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                    "NSX 1995-2002": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    }
                },
                "RDX": {
                    "RDX 2012-...": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                    "RDX 2006-2012": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    }
                },
                "RL": {
                    "RL 2008-2012": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                    "RL 2004-2008": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                    "RL 2001-2004": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                    "RL 1999-2001": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                    "RL 1996-1999": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    }
                },
                "RSX": {
                    "RSX 2005-2006": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                    "RSX 2001-2005": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    }
                },
                "SLX": {
                    "SLX 1998-2000": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                    "SLX 1996-1998": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    }
                },
                "TL": {
                    "TL 2003-2008": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                    "TL 1999-2003": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                    "TL 1996-1998": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    }
                },
                "TLX": {
                    "TLX 2017-...": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    },
                    "TLX 2014-2017": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    }
                },
                "TSX": {
                    "TSX 2003-2008": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    }
                },
                "Vigor": {
                    "Vigor 1989-1995": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    }
                },
                "ZDX": {
                    "ZDX 2009-...": {
                        main: [
                            {key: "Начало производства", value: ""},
                            {key: "Окончание производства", value: ""},
                            {key: "Кузов", value: ""}
                        ],
                        engine: [
                            {key: "Тип двигателя:", value: ""},
                            {key: "Марка топлива:", value: ""},
                            {key: "Объем двигателя, куб. см.:", value: ""},
                            {key: "Клапанов на цилиндр:", value: ""},
                            {key: "Наддув:", value: ""},
                            {key: "Мощность, л.с.:", value: ""},
                            {key: "Достигается при об. в мин.:", value: ""},
                            {key: "Крутящий момент, Нм/об. в мин.:", value: ""},
                            {key: "Максимальная скорость, км/ч:", value: ""},
                            {key: "Время разгона до 100 км/ч, сек.:", value: ""},
                            {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (в городе), л. на 100 км.:", value: ""},
                            {key: "Расход топлива (за городом), л. на 100 км.:", value: ""},
                            {key: "Компоновка двигателя:", value: ""},
                            {key: "Система питания:", value: ""},
                            {key: "Диaметр цилиндра, мм:", value: ""},
                            {key: "Ход поршня, мм:", value: ""},
                            {key: "Выхлоп CO2, г/км:", value: ""},
                            {key: "Коэффициент сжатия:", value: ""}
                        ],
                        gear: [
                            {key: "Тип привода:", value: ""}
                        ],
                        transmission: [
                            {key: "Коробка передач:", value: ""},
                            {key: "Количество ступеней:", value: ""}
                        ],
                        suspension: [
                            {key: "Передняя:", value: ""},
                            {key: "Задняя:", value: ""}
                        ],
                        brakes: [
                            {key: "Передние:", value: ""},
                            {key: "Задние:", value: ""}
                        ],
                        dimensions: [
                            {key: "Длина, мм:", value: ""},
                            {key: "Ширина, мм:", value: ""},
                            {key: "Высота, мм:", value: ""},
                            {key: "Колесная база, мм:", value: ""},
                            {key: "Колея колес спереди, мм:", value: ""},
                            {key: "Колея колес сзади, мм:", value: ""},
                            {key: "Клиренс, мм:", value: ""}
                        ],
                        other: [
                            {key: "Количество мест:", value: ""},
                            {key: "Снаряженная масса, кг:", value: ""},
                            {key: "Объем топливного бака, л:", value: ""}
                        ]
                    }
                }
            },
            'Alfa Romeo': {
                "Все модели",
                "145": {},
                "146": {},
                "147": {},
                "155": {},
                "156": {},
                "159": {},
                "164": {},
                "166": {},
                "33": {},
                "4C": {},
                "75": {},
                "90": {},
                "Alfetta": {},
                "Brera": {},
                "Giulia": {
                    main: [
                        {key: "Начало производства", value: "январь 2016"},
                        {key: "Окончание производства", value: "в производстве"},
                        {key: "Кузов", value: "4 дв. седан"}
                    ],
                    engine: [
                        {key: "Тип двигателя:", value: "V6"},
                        {key: "Марка топлива:", value: "Бензин АИ-95"},
                        {key: "Объем двигателя, куб. см.:", value: "2891"},
                        {key: "Клапанов на цилиндр:", value: "4"},
                        {key: "Наддув:", value: "турбонаддув"},
                        {key: "Мощность, л.с.:", value: "510"},
                        {key: "Достигается при об. в мин.:", value: "6500"},
                        {key: "Крутящий момент, Нм/об. в мин.:", value: "600/2500"},
                        {key: "Максимальная скорость, км/ч:", value: "307"},
                        {key: "Время разгона до 100 км/ч, сек.:", value: "3.9"},
                        {key: "Расход топлива (смешанный цикл), л. на 100 км.:", value: "8.5"},
                        {key: "Расход топлива (в городе), л. на 100 км.:", value: "12.8"},
                        {key: "Расход топлива (за городом), л. на 100 км.:", value: "6.1"},
                        {key: "Компоновка двигателя:", value: "переднее, продольное"},
                        {key: "Система питания:", value: "Непосредственный впрыск"},
                        {key: "Диaметр цилиндра, мм:", value: "86.5"},
                        {key: "Ход поршня, мм:", value: "82"},
                        {key: "Выхлоп CO2, г/км:", value: "198"},
                        {key: "Коэффициент сжатия:", value: "9.3"}
                    ],
                    gear: [
                        {key: "Тип привода:", value: "Задний"}
                    ],
                    transmission: [
                        {key: "Коробка передач:", value: "МКПП"},
                        {key: "Количество ступеней:", value: "6"}
                    ],
                    suspension: [
                        {key: "Передняя:", value: "Независимая, пружинная"},
                        {key: "Задняя:", value: "Независимая, пружинная"}
                    ],
                    brakes: [
                        {key: "Передние:", value: "Дисковые вентилируемые"},
                        {key: "Задние:", value: "Дисковые вентилируемые"}
                    ],
                    dimensions: [
                        {key: "Длина, мм:", value: "4639"},
                        {key: "Ширина, мм:", value: "1873"},
                        {key: "Высота, мм:", value: "1426"},
                        {key: "Колесная база, мм:", value: "2820"},
                        {key: "Колея колес спереди, мм:", value: "1550"},
                        {key: "Колея колес сзади, мм:", value: "1559"},
                        {key: "Клиренс, мм:", value: "100"}
                    ],
                    other: [
                        {key: "Количество мест:", value: "5"},
                        {key: "Снаряженная масса, кг:", value: "1580"},
                        {key: "Объем топливного бака, л:", value: "58"}
                    ]
                },
                "Giulietta": {},
                "GT": {},
                "GTV": {},
                "MiTo": {},
                "Spider": {},
                "Sprint": {},
                "Stelvio": {}
            },
            'Aston Martin': {
                "Все модели",
                "Cygnet": {},
                "DB11": {},
                "DB6": {},
                "DB7": {},
                "DB7 Zagato": {},
                "DB9": {},
                "DBS": {},
                "DBX": {},
                "Lagonda": {},
                "Rapide": {},
                "V12 Vantage": {},
                "V8": {},
                "V8 Vantage": {},
                "V8 Zagato": {},
                "Vanquish": {},
                "Virage": {}
            },
            'Audi': {
                "Все модели",
                "100",
                "200",
                "50",
                "80",
                "90",
                "A1",
                "A2",
                "A3",
                "A4",
                "A5",
                "A6",
                "A7",
                "A8",
                "Allroad",
                "Cabriolet",
                "Coupe",
                "E-tron",
                "Le Mans",
                "Pikes Peak",
                "Q2",
                "Q3",
                "Q5",
                "Q7",
                "Q8",
                "Quattro",
                "R8",
                "RS Q3",
                "RS2",
                "RS3",
                "RS4",
                "RS5",
                "RS6",
                "RS7",
                "S1",
                "S2",
                "S3",
                "S4",
                "S5",
                "S6",
                "S7",
                "S8",
                "SQ2",
                "SQ5",
                "SQ7",
                "SQ8",
                "TT",
                "V8"
            },
            'Bentley': {
                "Все модели",
                "Arnage",
                "Azure",
                "Bentayga",
                "Brooklands",
                "Continental",
                "Continental Flying Spur",
                "Continental GT",
                "Continental GTS",
                "Flying Spur",
                "Mulsanne"
            },
            'Bmw': {
                "Все модели",
                "1-серия",
                "2-серия",
                "3-серия",
                "4-серия",
                "5-серия",
                "6-серия",
                "7-серия",
                "8-серия",
                "Gran Turismo",
                "i3",
                "i8",
                "M Coupe",
                "M Roadster",
                "M1",
                "M2",
                "M3",
                "M4",
                "M5",
                "M6",
                "X1",
                "X2",
                "X3",
                "X4",
                "X5",
                "X6",
                "X7",
                "Z1",
                "Z2",
                "Z3",
                "Z4",
                "Z8"
            },
            'Bugatti': {
                "Все модели",
                "Chiron",
                "EB 110",
                "EB 112",
                "Veyron"
            },
            'Buick': {
                "Все модели",
                "Centure",
                "Enclave",
                "Le Sabre",
                "Park Avenue",
                "Rainier",
                "Reatta",
                "Regal",
                "Rendezvous",
                "Riviera",
                "Roadmaster",
                "Skulark"
            },
            'Cadillac': {
                "Все модели",
                "Allante",
                "ATS",
                "BLS",
                "Brougham",
                "CT6",
                "CTS",
                "CTS-V",
                "De Ville",
                "Eldorado",
                "Escalade",
                "Fleetwood",
                "Seville",
                "SRX",
                "STS",
                "XLR",
                "XT4",
                "XT5",
                "XT6",
                "XTS"
            },
            'Chery': {
                "Все модели",
                "Amulet",
                "Arrizo 7",
                "Bonus (A13)",
                "Bonus 3 (A19)",
                "CrossEastar (B14)",
                "Fora",
                "IndiS",
                "Kimo",
                "M11 (A3)",
                "Mikado",
                "Oriental Son",
                "QQ6",
                "Sweet",
                "Tiggo",
                "Tiggo 2",
                "Tiggo 3",
                "Tiggo 4",
                "Tiggo 7",
                "Tiggo 8",
                "Very"
            },
            'Chevrolet': {
                "Все модели",
                "Alero",
                "Astro",
                "Avalanche",
                "Aveo",
                "Beretta",
                "Blazer",
                "Bolt",
                "Camaro",
                "Caprice",
                "Captiva",
                "Cavalier",
                "Celta",
                "Cobalt",
                "Colorado",
                "Corsa",
                "Corsica",
                "Corvette",
                "Cruze",
                "Epica",
                "Eqinox",
                "Evanda",
                "Express",
                "Geo Storm",
                "HHR",
                "Impala",
                "Ipanema",
                "Kalos",
                "Lacetti",
                "Lanos",
                "Lumina",
                "Malibu",
                "Matiz",
                "Metro",
                "Monte Carlo",
                "Monza",
                "Niva (2123)",
                "Nubira",
                "Omega",
                "Orlando",
                "Prizm",
                "Rezzo",
                "S-10",
                "Silverado",
                "Spark",
                "SSR",
                "Suburban",
                "Tacuma",
                "Tahoe",
                "Tracker",
                "Traiblazer",
                "Trax",
                "Uplander",
                "Vectra",
                "Venture",
                "Viva",
                "Volt"
            },
            'Chrysler': {
                "Все модели",
                "200",
                "300C",
                "300M",
                "Cirrus",
                "Concorde",
                "Crossfire",
                "Daytona",
                "ES",
                "Grand Voyage",
                "GS",
                "GTS",
                "Intrepid",
                "Le Baron",
                "LHS",
                "Neon",
                "New Yorker",
                "Pacifica",
                "Prowler",
                "PT Cruiser",
                "Saratoga",
                "Sebring",
                "Stratus",
                "Town & Country",
                "Viper",
                "Vision",
                "Voyage"
            },
            'Citroen': {
                "Все модели",
                "2CV",
                "AX",
                "Axel",
                "Berlingo",
                "BX",
                "C-Crosser",
                "C-Elysee",
                "C-Zero",
                "C1",
                "C2",
                "C3",
                "C3 Aircross",
                "C3 Picasso",
                "C3 Pluriel",
                "C4",
                "C4 Aircross",
                "C4 Cactus",
                "C4 Grand Picasso",
                "C4 Picasso",
                "C4 SpaceTourer",
                "C5",
                "C5 Aircross",
                "C6",
                "C8",
                "CX",
                "DS3",
                "DS4",
                "DS5",
                "Dyane",
                "Evasion",
                "GSA",
                "Jumpy",
                "LNA",
                "Nemo",
                "Saxo",
                "SpaceTourer",
                "Visa",
                "Xantia",
                "XM",
                "Xsara",
                "Xsara Picasso",
                "ZX"
            },
            'Dacia': {
                "Все модели",
                "Dokker",
                "Duster",
                "Lodgy",
                "Logan",
                "Logan MCV",
                "Sandero",
                "Solenza",
            },
            'Daewoo': {
                "Все модели",
                "Arcadia",
                "Brougham",
                "Charman",
                "Espero",
                "Evanda",
                "Gentra",
                "Istana",
                "Kalos",
                "korando",
                "Lacetti",
                "Lanos",
                "Legazda",
                "Lublin",
                "Magnus",
                "Matiz",
                "Musso",
                "Nexia",
                "Nubira",
                "Polonez",
                "Prince",
                "Racer",
                "Rezzo",
                "Tacuma",
                "Tico",
                "Winstorm"
            },
            'DAF': {
                "Все модели",
                "33",
                "600",
                "66",
                "Daffodil",
                "2600",
                "45",
                "55",
                "85",
                "95",
                "CF",
                "LF",
                "Pony",
                "XF"
            },
            'Daihatsu': {
                "Все модели",
                "Altis",
                "Applause",
                "Atrai",
                "Be-go",
                "Boon",
                "Charage",
                "Charmant",
                "Copen",
                "Cuore",
                "Feroza",
                "Gran Move",
                "Leeza",
                "Materia",
                "Max",
                "Mira",
                "Move",
                "Naked",
                "Opti",
                "Rocky",
                "Rocky Hard Top",
                "Rocky Soft Top",
                "Rocky Wagon",
                "Sirion",
                "Storia",
                "Terios",
                "YRV"
            },
            'Datsun': {
                "Все модели",
                "mi-DO",
                "on-DO"
            },
            'Dodge': {
                "Все модели",
                "Avanger",
                "Caliber",
                "Caravan",
                "Challenger",
                "Charger",
                "Dakota",
                "Durango",
                "Grand Caravan",
                "Intrepid",
                "Journey",
                "Magnum",
                "Neon",
                "Nitro",
                "Ram 1500",
                "Ram 2500",
                "Ram 3500",
                "Spirit",
                "Stealth",
                "Stratus",
                "Stratus Coupe",
                "Viper"
            },
            'DS': {
                "Все модели",
                "DS 3",
                "DS 4",
                "DS 4 Crossback",
                "DS 5",
                "DS 7 Crossback"
            },
            'Ferrari': {
                "Все модели",
                "212",
                "250",
                "275",
                "308",
                "348",
                "360 Modena",
                "360 Spider",
                "400",
                "456",
                "456 GT",
                "458",
                "488",
                "512 TR",
                "550 Barchetta",
                "550 Maranello",
                "575 M Maranello",
                "599",
                "612 Scaglietti",
                "812 Superfast",
                "California",
                "Enzo",
                "F 355",
                "F 355 Berlinetta",
                "F 355 GTS",
                "F 355 Spider",
                "F 430",
                "F 430 Spider",
                "F 50",
                "F 512",
                "F12 Berlinetta",
                "F550 Barchetta",
                "FF",
                "GTC4",
                "Portofino",
                "Testarossa"
            },
            'Fiat': {
                "Все модели",
                "124 Spider",
                "126",
                "127",
                "131",
                "132",
                "500",
                "500X",
                "600",
                "900",
                "Albea",
                "Argenta",
                "Barchetta",
                "Brava",
                "Bravo",
                "Cinquecento",
                "Coupe",
                "Croma",
                "Doblo",
                "Doblt",
                "Ducato",
                "Freemont",
                "Fullback",
                "Grande Punto",
                "Idea",
                "Linea",
                "Marea",
                "Multipla",
                "Palio",
                "Panda",
                "Punto",
                "Punto Evo",
                "Qubo",
                "Regata",
                "Ritmo",
                "Scudo",
                "Sedici",
                "Siecento",
                "Siena",
                "Spazio",
                "Stilo",
                "Strada",
                "Tempra",
                "Tipo",
                "Ulysse",
                "Uno",
                "X1/9"
            },
            'Fisker': {
                "Все модели",
                "Karma",
                "Latigo CS",
                "Tramonto"
            },
            'Ford': {
                "Все модели",
                "Aerostar",
                "Aspire",
                "B-Max",
                "Bronco",
                "C-Max",
                "Capri",
                "Contour",
                "Cougar",
                "Crown Victoria",
                "Econoline",
                "EcoSport",
                "Edge",
                "Escape",
                "Escort",
                "Excursion",
                "Expedition",
                "Explorer",
                "Explorer Sport",
                "F-150",
                "F-250",
                "F-350",
                "Fiesta",
                "Focus",
                "Focus Coupe-Cabriolet>",
                "Freestar",
                "Freestyle",
                "Fusion",
                "Galaxy",
                "Granada",
                "Grand C-Max",
                "Ikon",
                "Ka",
                "Kuga",
                "Maverick",
                "Mondeo",
                "Mustang",
                "Orion",
                "Probe",
                "Puma",
                "Ranger",
                "S-Max",
                "Scorpio",
                "Shelby GT 500",
                "Sierra",
                "Taunus",
                "Taurus",
                "Thunderbird",
                "Tourneo Connect",
                "Transit",
                "Windstar"
            },
            'Geely': {
                "Все модели",
                "MK",
                "Atlas",
                "Emgrand",
                "Emgrand GT",
                "Emgrand X7 (GX 7)",
                "GC6",
                "GX 7",
                "MK Cross",
                "Otaka",
                "Tugella",
                "Vision (FC)"
            },
            'Genesis': {
                "Все модели",
                "G70",
                "G80",
                "G90"
            },
        },
        params: {},
        specs: {}
    },
    mounted() {
        const urlSearchParams = new URLSearchParams(window.location.search);
        this.params = Object.fromEntries(urlSearchParams.entries());
        this.specs = this.allSpecs.Acura.CL["CL 1997-2003"];

    }
})
